In [239]:
import pandas as pd
import numpy as np

In [ ]:
# 2-1) 법정동코드 전체자료.txt를 파일로부터 읽어서 데이터프레임으로 만드세요.
df = pd.read_csv('data/법정동코드 전체자료.txt', encoding='euc=kr', sep='\t')
df.head(3)


# 2-2) 현재 존재하는 경기도 수원시 데이터만 추출하세요.

df1 = df[df.폐지여부 == '존재'] 
df2 = df1[df1.법정동명.str.contains('경기도 수원시')]
df2.head()


# 2-3) 수원시 장안구에 있는 동의 이름을 추출하세요.
df3 = df2[(df2.법정동명.str.contains('수원시 장안구')) & ~(df.법정동명.str =='경기도 수원시 장안구')]
df3.법정동명.str[-3:].head(20)

 1) 열의 개수와 행의 개수가 각각 5개 이상이고, 데이터는 10에서 99까지 임의의
     정수인 데이터프레임을 만드세요.

  2) 열의 이름은 V, W, X, Y, Z 이고 행의 이름은 a, b, c, d, e 으로 만든다.

  3) 정 가운데에 있는 데이터를 인덱싱하려고 한다. 
     10개 이상의 방법으로 인덱싱하세요.

In [289]:
#  1) 열의 개수와 행의 개수가 각각 5개 이상이고, 데이터는 10에서 99까지 임의 정수인 데이터프레임을 만드세요.
# 2) 열의 이름은 V, W, X, Y, Z 이고 행의 이름은 a, b, c, d, e 으로 만든다.
df = pd.DataFrame(
    np.random.randint(10, 100, 25).reshape(5, 5),
    columns=list('VWXYZ'), index=list('abcde')
)
df

    V   W   X   Y   Z
a  54  52  38  77  57
b  66  23  41  61  51
c  78  76  13  46  69
d  46  61  55  80  27
e  54  47  30  13  33

In [263]:
# 2) 가운데값 출력_열 기준
df.X.c, df.X['c'], df['X']['c'], df['X'].c, df.X[2], df['X'][2]

# 가운데값 출력_[:]_행 기준
df[2:3]['X'][0], df[2:3].X[0], df[-3:]['X'][0], df[:]['X'][2]

74

In [243]:
# 가운데값 출력 _loc_행기준
df.loc['c','X'], df.loc['c']['X'], df.loc['c'].X, df.loc['c'][2]

# 가운데값 출력 _iloc_행기준
df.iloc[2,2], df.iloc[2][2], df.iloc[2]['X'], df.iloc[2].X

(74, 74, 74, 74)

In [291]:
# 각 행, 열의 합계
# 열방향(행의 합계)_'총점' 열 생성
# '평균' 열 새로 만들기
# '평균2'열 만들기(다른 방법)
# 행 추가 방법(행 추가는 잘 쓰이지 않음)

df.sum(axis=1)

a    278
b    242
c    282
d    269
e    177
dtype: int64

In [281]:
import seaborn as sns
tt = sns.load_dataset('titanic')
tt.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [282]:
# 1) 결측치를 찾아서 결측치를 제거 또는 대체하고, 그 이유를 간단히 적으세요.
tt.isna().sum()
tt.isna().sum().sum()

# 'deck'열: 열 전체 제거(결측치가 너무 많아 비정상 데이터로 판단)
tt.drop(columns=['deck'], inplace=True)

# 'age'열: 평균값으로 대체하여 사용(결측치가 전체의 20%정도이므로 양호함)
tt.age.fillna(tt.age.mean().round(2), inplace=True)

# 'embarked'열: 최빈값으로 대체(결측치 값이 매우 적어서 대체해도 영향력 거의 없음 흔한 값으로 대체)
tt.embarked.value_counts()
tt.embarked.fillna('S', inplace=True)
# tt.embarked.value_counts()

# embark_town열: 결측치가 있는 행 전체를 삭제(해당 행 전체가 결측치임)
tt.dropna(subset=['embark_town'], inplace=True)
# tt.isna().sum().sum()


tt.isna().sum().sum(), tt.shape

(0, (889, 14))

In [275]:
# 2) 나이의 결측치를 중앙값으로 대체한 후 qcut을 이용하여 나이에 따라 3개의 그룹으로 나누세요.
tt.age.fillna(tt.age.median(), inplace=True)

bins = [1, 20, 50, 100]     # 기준 입력_  1 < 미성년자 <= 20
labels = ["미성년자", "청중년", "장노년"]
cats = pd.cut(ages, bins, labels=labels)
cats


tt = pd.DataFrame(ages, columns=["ages"])
tt["age_cat"] = pd.cut(tt.ages, bins, labels=labels)
tt

tt['age_q'] = pd.qcut(ages, 3, labels=['Q1', 'Q2','Q3'])
tt

    ages age_cat age_q
0      0     NaN    Q1
1      2    미성년자    Q1
2     10    미성년자    Q1
3     21     청중년    Q2
4     23     청중년    Q2
5     37     청중년    Q3
6     31     청중년    Q2
7     61     장노년    Q3
8     20    미성년자    Q1
9     41     청중년    Q3
10    32     청중년    Q2
11   101     NaN    Q3

In [ ]:
# 3) 성별과 embark_town에 따른 생존율을 구하세요.

In [287]:
# 4) 타이타닉 탑승객의 성별에 따른 평균 나이를 구하세요.
tt[tt.sex == 'female'].age.mean().round(2)
tt[tt.sex == 'male'].age.mean().round(2)

30.51